# Stock Price Analysis and Comparison

Vincent Luong

Write brief introduction about time series analysis

In [1]:
import numpy as np
import pandas as pd
from datetime import datetime as dt
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

## Importing Datasets and Summary Statistics

### Tesla

In [2]:
tesla_dat = pd.read_csv('data/tesla.csv')
tesla_dat.head()

        Date       Open   High        Low      Close    Volume  Adj Close
0  6/29/2010  19.000000  25.00  17.540001  23.889999  18766300  23.889999
1  6/30/2010  25.790001  30.42  23.299999  23.830000  17187100  23.830000
2   7/1/2010  25.000000  25.92  20.270000  21.959999   8218800  21.959999
3   7/2/2010  23.000000  23.10  18.709999  19.200001   5139800  19.200001
4   7/6/2010  20.000000  20.00  15.830000  16.110001   6866900  16.110001

In [3]:
tesla_dat.describe

<bound method NDFrame.describe of            Date        Open        High         Low       Close    Volume  \
0     6/29/2010   19.000000   25.000000   17.540001   23.889999  18766300
1     6/30/2010   25.790001   30.420000   23.299999   23.830000  17187100
2      7/1/2010   25.000000   25.920000   20.270000   21.959999   8218800
3      7/2/2010   23.000000   23.100000   18.709999   19.200001   5139800
4      7/6/2010   20.000000   20.000000   15.830000   16.110001   6866900
...         ...         ...         ...         ...         ...       ...
1687  3/13/2017  244.820007  246.850006  242.779999  246.169998   3010700
1688  3/14/2017  246.110001  258.119995  246.020004  258.000000   7575500
1689  3/15/2017  257.000000  261.000000  254.270004  255.729996   4816600
1690  3/16/2017  262.399994  265.750000  259.059998  262.049988   7100400
1691  3/17/2017  264.000000  265.329987  261.200012  261.500000   6475900

       Adj Close
0      23.889999
1      23.830000
2      21.959999
3      19.200001
4      16.110001
...          ...
1687  246.169998
1688  258.000000
1689  255.729996
1690  262.049988
1691  261.500000

[1692 rows x 7 columns]>

In [18]:
tesla_dat.shape

(1692, 8)

### S&P 500

In [6]:
s500_dat = pd.read_csv('data/s500.csv')
s500_dat.head()

         date   open   high    low  close    volume Name
0  2013-02-08  15.07  15.12  14.63  14.75   8407500  AAL
1  2013-02-11  14.89  15.01  14.26  14.46   8882000  AAL
2  2013-02-12  14.45  14.51  14.10  14.27   8126000  AAL
3  2013-02-13  14.30  14.94  14.25  14.66  10259500  AAL
4  2013-02-14  14.94  14.96  13.16  13.99  31879900  AAL

In [7]:
s500_dat.describe

<bound method NDFrame.describe of               date   open   high    low  close    volume Name
0       2013-02-08  15.07  15.12  14.63  14.75   8407500  AAL
1       2013-02-11  14.89  15.01  14.26  14.46   8882000  AAL
2       2013-02-12  14.45  14.51  14.10  14.27   8126000  AAL
3       2013-02-13  14.30  14.94  14.25  14.66  10259500  AAL
4       2013-02-14  14.94  14.96  13.16  13.99  31879900  AAL
...            ...    ...    ...    ...    ...       ...  ...
619035  2018-02-01  76.84  78.27  76.69  77.82   2982259  ZTS
619036  2018-02-02  77.53  78.12  76.73  76.78   2595187  ZTS
619037  2018-02-05  76.64  76.92  73.18  73.83   2962031  ZTS
619038  2018-02-06  72.74  74.56  72.13  73.27   4924323  ZTS
619039  2018-02-07  72.70  75.00  72.69  73.86   4534912  ZTS

[619040 rows x 7 columns]>

In [19]:
#See if this dataset includes TSLA stocks

#unique_count = s500_dat['Name'].unique()
#for name in unique_count:
#    print(name)


#Code ran and it doesn't include Stocks from TSLA

In [20]:
s500_dat.shape

(619040, 7)